Info


https://howtodoinjava.com/spring-boot/spring-boot-soap-webservice-example/

mvn clean install
mvn spring-boot:run

http://localhost:8080/service/studentDetailsWsdl.wsdl

open SoapUI
give the WSDL URL http://localhost:8080/service/studentDetailsWsdl.wsdl
test with the following request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.howtodoinjava.com/xml/school">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:StudentDetailsRequest>
         <sch:name>Sajal</sch:name>
      </sch:StudentDetailsRequest>
   </soapenv:Body>
</soapenv:Envelope>
